In [1]:
import numpy as np
import pandas as pd

In [2]:
#define two dataframes

In [9]:
np.random.seed(0)
df1 = pd.DataFrame(data=np.random.normal(size=(2,3)))
df2 = pd.DataFrame(data=np.random.normal(size=(2,3)))

In [10]:
df1

          0         1         2
0  1.764052  0.400157  0.978738
1  2.240893  1.867558 -0.977278

In [11]:
df2

          0         1         2
0  0.950088 -0.151357 -0.103219
1  0.410599  0.144044  1.454274

In [12]:
#append the two dataframes together

In [13]:
df1.append(df2)

          0         1         2
0  1.764052  0.400157  0.978738
1  2.240893  1.867558 -0.977278
0  0.950088 -0.151357 -0.103219
1  0.410599  0.144044  1.454274

In [14]:
#define new df with the results of append

In [15]:
df =df1.append(df2)

In [16]:
df

          0         1         2
0  1.764052  0.400157  0.978738
1  2.240893  1.867558 -0.977278
0  0.950088 -0.151357 -0.103219
1  0.410599  0.144044  1.454274

In [17]:
#generate new default indices for appened records

In [18]:
df = df1.append(df2,ignore_index=True)

In [19]:
df

          0         1         2
0  1.764052  0.400157  0.978738
1  2.240893  1.867558 -0.977278
2  0.950088 -0.151357 -0.103219
3  0.410599  0.144044  1.454274

In [20]:
np.random.seed(0)
df1 = pd.DataFrame(data=np.random.normal(size=(2,3)),index=['X','Y'],columns=['aa','bb','cc'])
df2 = pd.DataFrame(data=np.random.normal(size=(2,3)),index=['Z','W'],columns=['aa','bb','cc'])

In [21]:
#Continue with current index
df =df1.append(df2)
df

         aa        bb        cc
X  1.764052  0.400157  0.978738
Y  2.240893  1.867558 -0.977278
Z  0.950088 -0.151357 -0.103219
W  0.410599  0.144044  1.454274

In [22]:
#generate new default index with appended data
df = df1.append(df2,ignore_index=True)
df

         aa        bb        cc
0  1.764052  0.400157  0.978738
1  2.240893  1.867558 -0.977278
2  0.950088 -0.151357 -0.103219
3  0.410599  0.144044  1.454274

In [23]:
#We want to add the series to the dataframe as a new row
#you must 'name' the series indece before it can be placed into the dataframe

np.random.seed(0)
df1 = pd.DataFrame(data=np.random.normal(size=(2,3)),index=['X','Y'],columns=['aa','bb','cc'])
ser = pd.Series(data=np.random.normal(size=3),index=['aa','bb','cc'],name='Z')

In [24]:
df1

         aa        bb        cc
X  1.764052  0.400157  0.978738
Y  2.240893  1.867558 -0.977278

In [25]:
ser

aa    0.950088
bb   -0.151357
cc   -0.103219
Name: Z, dtype: float64

In [30]:
df = df1.append(ser)
df

         aa        bb        cc
X  1.764052  0.400157  0.978738
Y  2.240893  1.867558 -0.977278
Z  0.950088 -0.151357 -0.103219

In [31]:
df = df1.append(ser,ignore_index=True)
df

         aa        bb        cc
0  1.764052  0.400157  0.978738
1  2.240893  1.867558 -0.977278
2  0.950088 -0.151357 -0.103219

In [32]:
np.random.seed(0)
df1 = pd.DataFrame(data=np.random.normal(size=(2,3)),index=['X','Y'],columns=['aa','bb','cc'])
df2 = pd.DataFrame(data=np.random.normal(size=(2,3)),index=['Z','W'],columns=['aa','bb','dd'])

In [37]:
df1

         aa        bb        cc
X  1.764052  0.400157  0.978738
Y  2.240893  1.867558 -0.977278

In [38]:
df2

         aa        bb        dd
Z  0.950088 -0.151357 -0.103219
W  0.410599  0.144044  1.454274

In [40]:
df1.append(df2)

         aa        bb        cc        dd
X  1.764052  0.400157  0.978738       NaN
Y  2.240893  1.867558 -0.977278       NaN
Z  0.950088 -0.151357       NaN -0.103219
W  0.410599  0.144044       NaN  1.454274

In [41]:
df1.append(df2,sort=False)

         aa        bb        cc        dd
X  1.764052  0.400157  0.978738       NaN
Y  2.240893  1.867558 -0.977278       NaN
Z  0.950088 -0.151357       NaN -0.103219
W  0.410599  0.144044       NaN  1.454274

In [42]:
#how to add a series as a column in an existing dataframe

In [54]:
np.random.seed(0)
df1 = pd.DataFrame(data=np.random.normal(size=(3,3)),index=['X','Y','Z'],columns=['aa','bb','cc'])
ser = pd.Series([1000,2000,3000],index=['X','Y','Z'])

In [55]:
ser

X    1000
Y    2000
Z    3000
dtype: int64

In [58]:
#Append new column to dataframe
df1['gg']=ser

In [59]:
df1

         aa        bb        cc    gg
X  1.764052  0.400157  0.978738  1000
Y  2.240893  1.867558 -0.977278  2000
Z  0.950088 -0.151357 -0.103219  3000

In [60]:
#create a new column from operations from the original columns 
#element wise addition

In [61]:
df1['aabb']=df1['aa']+df1['bb']

In [62]:
df1

         aa        bb        cc    gg      aabb
X  1.764052  0.400157  0.978738  1000  2.164210
Y  2.240893  1.867558 -0.977278  2000  4.108451
Z  0.950088 -0.151357 -0.103219  3000  0.798731

In [74]:
#Drop single row and columns
np.random.seed(0)
df1 = pd.DataFrame(data=np.random.normal(size=(3,5)),index=['X','Y','Z'],columns=['aa','bb','cc','dd','ee'])

In [75]:
df1

         aa        bb        cc        dd        ee
X  1.764052  0.400157  0.978738  2.240893  1.867558
Y -0.977278  0.950088 -0.151357 -0.103219  0.410599
Z  0.144044  1.454274  0.761038  0.121675  0.443863

In [76]:
# axis = 0 => rows 
# axis = 1 => columns 

#inplace will generate results without needed to be assigned to variable

In [77]:
df1.drop('X',axis=0,inplace=True)

In [78]:
df1

         aa        bb        cc        dd        ee
Y -0.977278  0.950088 -0.151357 -0.103219  0.410599
Z  0.144044  1.454274  0.761038  0.121675  0.443863

In [79]:
# Drop multiple columns

In [80]:
df1.drop(['aa','ee'],axis=1,inplace=True)

In [81]:
df1

         bb        cc        dd
Y  0.950088 -0.151357 -0.103219
Z  1.454274  0.761038  0.121675

In [83]:
#get rid of duplicate data

In [85]:
df = pd.DataFrame(data=[[1,2,3,4,5],[1,2,3,4,5],[10,20,30,40,50]],
                 index=list('XZY'),
                 columns=list('ABCDE'))

df

    A   B   C   D   E
X   1   2   3   4   5
Z   1   2   3   4   5
Y  10  20  30  40  50

In [86]:
df.drop_duplicates()
#df.drop_duplicates(keep='last')

    A   B   C   D   E
X   1   2   3   4   5
Y  10  20  30  40  50